IRP/src/Enums/ShipmentConfirmationTransactionTypes/ShipmentConfirmationTransactionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ShipmentConfirmationTransactionTypes</name>
 <enumValues>
  <name>InventoryTransfer</name>
 </enumValues>
 <enumValues>
  <name>Sales</name>
 </enumValues>
 <enumValues>
  <name>ReturnToVendor</name>
 </enumValues>
 <enumValues>
  <name>ShipmentToTradeAgent</name>
 </enumValues>
 <enumValues>
  <name>ReturnToConsignor</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/ShipmentConfirmationTransactionTypes/ManagerModule.bsl
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	StandardProcessing = False;
	ChoiceData = New ValueList();
	ChoiceData.Add(InventoryTransfer);
	ChoiceData.Add(Sales);
	ChoiceData.Add(ReturnToVendor);
	
	If FOServer.IsUseCommissionTrading() Then
		ChoiceData.Add(ShipmentToTradeAgent);
		ChoiceData.Add(ReturnToConsignor);
	EndIf;	
EndProcedure
